[
  {
    "path": "posts/2022-02-22-snowshoehares/",
    "title": "Project: Snowshoe Hares",
    "description": "An assignment from my data analysis class on juvenile snowshoe hares",
    "author": [
      {
        "name": "Devin Ngo",
        "url": {}
      }
    ],
    "date": "2022-02-22",
    "categories": [],
    "contents": "\n\n\n\n1. Introduction\nThis report explores data on juvenile snowshoe hares, including the sex, weight, trap site, and hind foot length. The hares were observed as a part of a Long Term Ecological Research (LTER) study from 1999 - 2012 (Kielland et. al. (2017)) in the Bonanza Creek Experimental Forest. First, this report looks at annual juvenile hare trap counts. Then it visualizes juvenile hare weights by sex and trap site. Finally, it analyzes the relationship between hare weight and hind foot length.\n2. Data and Analyses\nData on snowshoe hares was provided by the Bonanza Creek Long Term Ecologicial Research (LTER) group in a study done by Kielland et. al. (2017). This study was conducted in the Bonanza Creek Experimental Forest from 1999 to 2012, splitting up into three different sites (Bonanza Riparian (bonrip) , site in a mature lowland black spruce stand (bonbs), and Bonanza Mature (bonmat)). The data contains 3197 observations for 14 variables including sex, age, weight (grams), hind foot length (mm), and grid (trap site). Weights between male and female juvenile hares are compared by two-sample t-tests with a significance level (\\(\\alpha\\)) of 0.05 throughout. Group differences are described by Cohen’s d effect size. A simple linear regression is used to explore the relationship between hind foot length and weight. All analyses are conducted using R version 4.1.1 and RStudio Version 1.4.1717.\n3. Juvenile Hare Initial Investigation\nI. Annual Juvenile Hare Trap Counts\n\n\n\nFigure 1. Annual juvenile hare trap counts from 1999 to 2012. Data: Kielland et al. (2017).\nTakeaways: The minimum count of juvenile hare trappings is 2 and the maximum is 126. The mean is 31.5 and the median is 18.5. It seems that juvenile hare trappings started high initially but eventually lowered and began varying in count. To standardize the juvenile hare population in future analyses, there should be consistency where the same number of traps are set the same each year, as well as on the same days.\nII. Visualizing Juvenile Hare Weights\n\n\n\nFigure 2. Juvenile hare weight comparisons by sex and site. Looks at the distribution of juvenile hare weight sizes for female, male, and unknown sexes, separated by site. The box endpoints display the 25th and 75th percentile values while the box lines indicates the median value and the black point indicates the mean value for the hares. Data: Kielland et al. (2017).\nIII. Juvenile Weight Comparison (Male & Female Snowshoe Hares)\n\n\n\nTable 1. Descriptive statistics including the mean, standard deviation, and sample size for juvenile hares weights, separated by sex. Data: Kielland et al. (2017).\n\n\nSex\n\n\nMean Weight (g)\n\n\nStandard Deviation of Weight (g)\n\n\nSample Size (n)\n\n\nFemale\n\n\n855.39\n\n\n292.25\n\n\n197\n\n\nMale\n\n\n945.86\n\n\n333.22\n\n\n163\n\n\nMeans Comparison: On average, mean weight of male hares is greater than the weight of female hares. The actual difference in means between male and female hares is 90.47, which gives a percent difference of 10.05%. The difference in means is significant (Welch’s two-sample t-test: t(325.02) = -2.71, p = 0.007). There is also a small effect size (Cohen’s d = -0.29).\nIV. Relationship Between Juvenile Weight & Hind Foot Length\n\n\n\nFigure 3. Relationship between hind foot length (mm) and weight (g) for juvenile hares, both male and female, as well as those with an unknown sex. The points indicate individual hare measurements where purple = female juvenile hares, blue = male juveline hares; gray = juvenile hares of an unknown sex). Linear model summary: \\(\\beta\\)1 = 9.52 g mm-1, p < 0.001, R2 = 0.3, Pearson’s r = 0.55. Data: Kielland et al. (2017).\nOutcome of linear regression exploration: Hare weight and hind foot length appear to have a relatively linear relationship for both sexes of hares. Simple linear regression reveals that hind foot length can predict hare weight (p < 0.001, R2 = 0.3) with an average slope of \\(\\beta\\) = 9.52 g mm-1. However, this R2 value is not necessarily strong as hind foot length (mm) variation can only explain 30% of the weight (g) variation in our data. For every one mm increase in hind foot length, on average we can expect hare weight to increase by 9.52 g. There is a moderate, significant, and positive correlation between hind foot length and hare weight (Pearson’s r = 0.55, p < 0.001). Diagnostic plots show the data having a heteroscedastic spread of residuals, which is a concern and indicates further analysis needs to be done.\n4. Summary\nExploratory data analysis reveals the following initial findings:\nFor all trapping sites, the male snowshoe hare mean weight was found to be larger than the female snowshoe hare mean weight (the difference is significant, and the effect size is small).\nWhile there is a slight positive linear relationship between hare weight and hind foot length, it was determined by the R2 that only 30% of weight variance can be explained by hind feet length variance.\nOn average, when hind foot length increases by one mm, we can expect hare weight to increase by 9.52 g.\nThere is a moderate, significant, and positive correlation between hind foot length and hare weight (Pearson’s r = 0.55, p < 0.001), but residuals show a heteroscedastic spread.\nNext Steps:\nFurther data analysis needs to be conducted since data appears to be heteroscedastic.\nStandardize the juvenile hare population in future analyses by setting the same number of traps each year on the same days.\n5. Citations\nKielland, K., F.S. Chapin, R.W. Ruess, and Bonanza Creek LTER. 2017. Snowshoe hare physical data in Bonanza Creek Experimental Forest: 1999-Present ver 22. Environmental Data Initiative. https://doi.org/10.6073/pasta/03dce4856d79b91557d8e6ce2cbcdc14\n\n\n\n",
    "preview": "posts/2022-02-22-snowshoehares/snowshoehares_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2022-02-22T00:43:45-08:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-01-21-welcome/",
    "title": "Welcome",
    "description": "Welcome to my personal website!",
    "author": [
      {
        "name": "Devin Ngo",
        "url": {}
      }
    ],
    "date": "2022-02-06",
    "categories": [],
    "contents": "\nWelcome to my personal website where I will be tracking the progress I make entering the world of data science! I first began learning R in my first quarter of graduate school at UCSB Bren School of Environmental Science and Management, through a course on data analysis. I am currently taking another course this quarter to further advance my skills in data anlaysis and using R.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-02-22T00:44:41-08:00",
    "input_file": {}
  }
]
